#include <stdio.h>
#include <stdint.h>

int main(){
    uint32_t s;
    scanf("%u", &s);
    //В этой формуле целочисленное деление будет работать всегда, дробной части никогда не будет, но возможно переполнение
    //я бы использовал ((uint64_t)s * ((uint64_t)s + 1))>>1
    //флоат теряет точность, но избегает переполнения
    //код будет работать вплоть до 2^32-2 (при 2^32-1 выражение в скобках даст 0)
    printf("%llu\n", (unsigned long long)((float)s * (s + 1)/2));
    printf("%llu, %llu\n", sizeof(float),sizeof(uint32_t));
    return 0;
}